# 방송사와 요일을 선택하면 해당 방송사의 프로그램들이 방영시간 순으로 조회되는 쿼리

# - 방송사를 선택하면 해당 방송사에 속한 프로그램들을 조회하는 쿼리

# - 요일을 선택하면 해당 요일에 방영되는 모든 프로그램들을 조회하는 쿼리

# 유저를 선택하면 해당 유저가 즐겨찾기한 프로그램들을 조회하는 쿼리

# 프로그램 선택 시, 해당 프로그램의 장르들을 조회하는 쿼리

# 즐겨찾기에 프로그램과 프로그램이 속한 요일,시간을 등록하는 쿼리




/*
처음 화면 - 프로그램 조회(요일별,  방송사별로 해서, KBS의 월요일이 기본값으로) + 로그인 회원가입 프로그램검색후상세정보출력
로그인 시, 해당 아이디가 ADMIN이면 방송사, 프로그램, 편성표 입력 수정 삭제 (KBS MBC SBS는 삭제 불가) 
로그인 시, 해당 아이디가 USER이면 프로그램검색후상세정보출력 - 즐겨찾기등록 / 즐겨찾기 검색 / 즐겨찾기 삭제
회원가입 시, 아이디 중복체크, USER로 등록(차후 ADMIN 권한 부여 가능하게 할지는 생각)
프로그램검색후상세정보출력 시, 요일, 시간대, 장르, 방송사, 프로그램 제목(, 출연진?)으로 검색.
- USER일 시 - 즐겨찾기 등록 시, 해당 유저의 즐겨찾기 데이터에 해당 프로그램을 등록. 
즐겨찾기 검색 시, 즐겨찾기한 프로그램들을 출력

*/